In [ ]:
import pandas as pd
Import SQL Alchemy
from sqlalchemy import create_engine
from config import sqlpass
import matplotlib.pyplot as plt
import numpy as np
from matplotlib import colors
from matplotlib.ticker import PercentFormatter
#import mysql.connector

In [ ]:
dbConnString = "postgres://postgres:{}@khushbooshah.us:781/mystery_db".format(sqlpass)

In [7]:
# Create Database Connection
# ----------------------------------
# Establish Connection
engine = create_engine(dbConnString)
dbconn = engine.connect()

In [9]:
salaries=pd.read_sql_query('''select emp_no as "Employee Number", salary as "Salary" from salaries''',dbconn)

In [10]:
salaries

       Employee Number Salary
0                10001  60117
1                10002  65828
2                10003  40006
3                10004  40054
4                10005  78228
...                ...    ...
199995          299971  40000
199996          299972  84832
199997          299973  63007
199998          299974  40000
199999          299975  73561

[200000 rows x 2 columns]

In [ ]:
#Create a histogram to visualize the most common salary ranges for employees.
Bins = np.arange(salaries.Salary.astype(int).min()-10000,salaries.Salary.astype(int).max()+10000,10000)
labels=['30000-40000','40000-50000','50000-60000','60000-70000','70000-80000','80000-90000','90000-100000','100000-110000','110000-120000','120000-130000']
Analysis=pd.DataFrame({"Salary":salaries["Salary"].astype(int)})
Analysis["Salary Range"]=pd.cut(Analysis["Salary"],Bins,labels=labels,right=True)
Histogram=Analysis.hist()
for b in Histogram.flatten():
    b.set_xlabel("Salary Amount")
    b.set_ylabel("Salary Range")
    b.set_title("Analysis")

In [32]:
#Create a bar chart of average salary by title.
ByTitle=pd.read_sql_query('''select t.emp_no as "EmployeeNo",t.title as "Title",s.salary as "Salary" 
from titles t join salaries s on t.emp_no=s.emp_no''',dbconn)

In [69]:
Group_Title=ByTitle.Title.unique()
i=0
data=[]
for title in Group_Title:
    Salary_Mean=round(ByTitle[ByTitle["Title"] == title].Salary.astype(int).mean(),2)
    data.append(Salary_Mean)
    if (i==0):
        Analysis2=pd.DataFrame({"Title": title,"Average Salary" : [Salary_Mean]}).set_index('Title')
    else:
        df=pd.DataFrame({"Title": title,"Average Salary" : [Salary_Mean]}).set_index('Title')
        Analysis2=Analysis2.append(df)
    i=i+1
Analysis2

                    Average Salary
Title
Senior Engineer           48502.66
Engineer                  48522.08
Staff                     58465.58
Technique Leader          48589.43
Assistant Engineer        48531.52
Senior Staff              58481.88
Manager                   51531.04

In [ ]:
columns=Group_Title
n_rows = len(data)
rows = ['%d dollars' % x for x in (100, 50, 20, 10, 5)]
plt.figure(figsize=(20,5))
plt.bar(Analysis2.index,Analysis2["Average Salary"],color='red', edgecolor='black', hatch="/")
plt.ylabel("Average Salary")
plt.title('Average Salary across Jobs')
plt.show()